#include<stdio.h>

 

int add(int a,int b) // ফাংশন ডিক্লেয়ার করা হয়েছে যার নাম add, প্যারামিটার হিসেবে দুটি সংখ্যা নেওয়া হচ্ছে, তাই প্যারামিটারে দুটি int ভেরিয়েবল ডিক্লেয়ার করা হচ্ছে। এই ফাংশনটি প্যারামিটার হিসেবে নেওয়া দুটি সংখ্যা যোগ করে যোগফল রিটার্ন করবে তাই এটির রিটার্ন টাইপ হচ্ছে int 

{

 int ans = a+b; // প্যারামিটার হিসেবে নেওয়া দুটি সংখ্যা যোগ করে যোগফলটি একটি ভেরিয়েবলে স্টোর করে রাখা হচ্ছে।

 return ans; // যোগফলটি রিটার্ন করে দেওয়া হচ্ছে।

}
int main()

{

 int a,b; 

 scanf("%d %d",&a,&b); // দুটি সংখ্যা ইনপুট নেওয়া হচ্ছে। 

 int sum = add(a,b); // add ফাংশনকে কল করা হচ্ছে এবং প্যারামিটার হিসেবে ইনপুট নেওয়া দুটি সংখ্যা দিয়ে দেওয়া হচ্ছে। ফাংশনটি কল করার পর যা রিটার্ন করবে তা sum ভেরিয়েবলে স্টোর করা হচ্ছে।

 printf("sum = %d",sum); // sum ভেরিয়েবলটি প্রিন্ট করা হচ্ছে যেটিতে দুটি সংখ্যার যোগফল স্টোর রয়েছে।

}
